# CeilingHasThicknessParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CeilingHasThicknessParam Property
ParameterTypeId Class See Also
---
"Has Thickness"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CeilingHasThicknessParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CeilingHasThicknessParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CeilingHasThicknessParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace